<?php

// Рекрусивные функции - функция вызывает саму себя!!

function recur($num) {
  // Если параметра $num меньше 10, продолжаем рекурсию
  if ($num >= 10) {
  // Уменьшать значение параметра $num и его выводим в браузер
    echo ($num --) . "<br>";
    // Производим рекрсивный вызов функции
    recur($num);
  }else return;
}

recur(15);


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Факториал - это произвеение всех целых чисел, меньших или равных даному числу!!!

function factorial($num) {
  if ($num <= 1) return 1;
  // здесь у нас происходим повторный вызов функции
  return $num * factorial($num - 1);  
}

//echo factorial(8);

function factorial2($num) {
  $result = 1;
  for ($i = 1; $i <= $num; $i++) {
    $result *= $i;
  }
  return $result;
}
echo factorial2(8);

















?>